/*源代码如下：
#include <stdio.h>

int main()
{
	int a[3][4] = { {1,3,5,7},{9,11,13,15},{17,19,21,23} };
	printf("%d\n", a[2][1]);
	printf("%d\n", a[1]);
	printf("%d\n", a);
	printf("%d\n", a + 1);
	printf("%d\n", *a + 1);
	printf("%d\n", *(a + 1));
	printf("%d\n", a[2] + 1);
	printf("%d\n", *(a + 1) + 1);
	printf("%d\n", *(*(a + 2) + 2));
	return 0;
}
*/
//由于实际回答时需将地址值修改，故将源代码修改如下：
#include <stdio.h>

int main()
{
	printf("19\n");
	printf("2016\n");//第一行数组的地址值 2000+4*4
	printf("2000\n");//整个数组的地址值 2000
	printf("2016\n");//a加一后的地址值，相当于第一行的地址值 2000+4*4
	printf("2004\n");//a地址值的后一位元素的地址值 2000+4
	printf("2016\n");//首地址加一后的值 相当于第一行地址值 2000+4*4
	printf("2036\n");//第二行数组第一位的地址值 2000+4*4*2+2
	printf("2020\n");//第一行的地址值再加上一位元素的地址值 2000+4*4+4
	printf("21\n");//双重指针即为找该地址的值，第二行地址值再加上两位元素的地址值为 2000+4*4*2+4*2=2042 在数组对应的值为21
	return 0;
}